Revit 2026 API

# DesignToFabricationConverterConvert Method

---
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DesignToFabricationConverterResult Convert(
	ISet<ElementId> selection,
	int serviceId
)
```
```vb
Public Function Convert (
	selection As ISet(Of ElementId),
	serviceId As Integer
) As DesignToFabricationConverterResult
```
```cpp
public:
DesignToFabricationConverterResult Convert(
	ISet<ElementId^>^ selection,
	int serviceId
)
```
```fsharp
member Convert :
        selection : ISet<ElementId> *
        serviceId : int -> DesignToFabricationConverterResult
```

#### Parameters

selection ISetElementId

serviceId Int32

#### Return Value

DesignToFabricationConverterResult

#### Reference

DesignToFabricationConverter Class

Autodesk.Revit.DB.Fabrication Namespace